// Написать функцию, которая считает разницу между датами. Функция принимает 6 параметров, которые описывают 2 даты, и возвращает результат в виде строки «чч:мм:сс». При выполнении задания используйте функции из предыдущих 2-х заданий: сначала обе даты переведите в секунды, узнайте разницу в секундах, а потом разницу переведите обратно в «чч:мм:сс».
function date(a = +prompt("Введите данные"), b = +prompt("Введите данные"), c = +prompt("Введите данные"),
    d = +prompt("Введите данные"), e = +prompt("Введите данные"), f = +prompt("Введите данные")) {
    let date1 = time(a, b, c);
    let date2 = time(d, e, f);
    return timeinseconds(date1 - date2);
}
function time(a, b, c) {
    return a * 3600 + b * 60 + c;
}

function timeinseconds(a = +prompt("Введите количество секунд")) {
    let sec = a % 60;
    let min = ((a - sec) / 60) % 60;
    let hr = (a - sec - min * 60) / 3600;
    return hr + " : " + min + " : " + sec;

}
alert(date());